
{
"blacklight":"First, prepare four liquid samples separately: pour about 15mL of water into each of four cups, then dip the tip of a red, green, and yellow highlighter into three of the cups respectively and squeeze out one drop of ink into each, and add powdered detergent to the fourth cup and mix until dissolved with about 15mL of water. Next, shine a black light on each of the four single liquids to observe and note their luminescent colors. After that, prepare two mixed liquids: mix the powdered detergent solution with the red and green highlighter solutions in one new cup, and mix the powdered detergent solution with the yellow highlighter solution in another new cup. Finally, shine a black light on each mixed liquid to check if it turns white.",
"cardboard":"First, draw auxiliary lines for the shape and folds on cardboard and paper as per dimensional drawings. Cut along the shape's auxiliary lines on both, leaving the liner ends on cardboard for gluing. Make incisions on the fold auxiliary lines of both cardboard and paper, then fold along these incisions. Next, make a cross-shaped incision in the lid (paper), put chopsticks through it to widen the hole. Glue the cardboard's liner, then tape the lid and bottom paper to the cardboard to secure them. After that, glue the lid and bottom to cover the cardboard body, and finally insert chopsticks into the body.",
"electronics":"First, connect the battery box, switch S1, and motor in series (with S1 between the battery box and motor), then connect switch S2 and lamp L1 in parallel and wire S2 into the series circuit of the motor and battery box. Next, attach a propeller to the motor, place two batteries into the battery box, then turn on switch S1 and switch S2 in sequence.",
"ion":"Place a microplate on the grid of a worksheet first, then take tweezers from a bag. Use the tweezers to put three copper plates in the microplate's left column, three zinc plates in the center column, and three magnesium plates in the right column. Next, add one drop of copper sulfate aqueous solution to each metal plate in the first row, one drop of zinc sulfate aqueous solution to each in the middle row, and one drop of magnesium sulfate aqueous solution to each in the last row. Finally, fill the results into the table on the worksheet and write down the metals in the worksheet in order from the most reactive to the least.",
"tsumiki":"First, arrange three cube blocks in a left-to-right row: blue, green, yellow. Bridge two long thin cuboid blocks on these cubes, left to right: blue, green. Next, stand three short thin cuboid blocks equally spaced left to right: blue, green, yellow; bridge two long thin cuboids on these upright blocks, left to right: yellow, red. Then place two thick cuboid blocks on this bridge, laid down left to right: yellow, red. Lay one blue thick cuboid block down and stack it at the upper center of the yellow and red thick cuboids. Finally, place two triangular prism blocks on both sides of the blue thick cuboid, left to right: blue, red.",
"toy car assembly":"Start by attaching the wheel, step, base, and interior to the chassis in sequence—these are the most common foundational steps. Next, install the door to the window and chassis (repeated multiple times as a key assembly action), followed by securing the cabin back to both the chassis and interior. Then, attach the windshield to the chassis, mount the roof onto the cabin back (performed twice for stability), and finally connect the container to the base. Supplementary assembly steps may include attaching the cabin to the interior or chassis, the body to the chassis, the bumper to the cabin/body/chassis, the engine cover to the body, the light to the roof, and specialized components like the arm to the boom, the bucket to the arm, or the boom to the turntable top as needed for specific toy car models.",
"tent assembly":"To assemble the tent, first follow the instruction, then pickup/open the tentbag and spread the tent; next, pickup/open the supportbag twice, spread the tent again, assemble the support, insert the support, spread the tent a third time, insert the support again, and insert the support tab four times (two times consecutively twice); afterward, pickup/open the stakebag, place the guyline twice, and insert the stake four times (two times consecutively followed by two more times); then pickup/place the ventcover twice, with additional pickup/open actions for the supportbag twice and the stakebag once in between; finally, tie the top to complete the assembly.",
"Blender Banana Pancakes":"To make Blender Banana Pancakes, first blend a banana, an egg, 1/2 tsp baking powder, and 1 heaped tbsp flour until smooth, then pour the mixture into a heated non-stick frying pan and cook each pancake for about 1 minute on each side. Finally, top the cooked pancakes with 1 chopped strawberry and splash a drizzle of maple syrup before serving, cook for 20-30 seconds more.",
"Breakfast Burritos":"To prepare a breakfast burrito, start by whisking an egg in a microwave-safe bowl, then microwave it for 3 minutes, stirring occasionally. Next, mix in 1/2 tbsp sweet and sour sauce, oregano, and 1 tablespoon of salsa, and pour this mixture over a tortilla placed on a cutting board. Top with 1 tbsp shredded cheddar cheese, then roll the tortilla tightly into a log shape, about 1.5 inches thick, ensuring it's sealed properly to hold the filling.",
"Broccoli Stir Fry":"To make Broccoli Stir Fry, first prepare the sauce by combining 1/8 teaspoon black pepper, 1/8 cup soy sauce, water, 1 teaspoon cornstarch, minced garlic, 1/2 tablespoon minced ginger, 1 tablespoon honey, and 2 tablespoons of olive oil, then set it aside. Next, slice 1/3 of the bell pepper and mushrooms, and peel and mince 2 cloves of garlic. In a skillet, heat olive oil over medium-high heat, add the sliced mushrooms and broccoli, and cook for 4 minutes, adjusting the heat if necessary. Add the sliced bell pepper and continue cooking for 2-3 minutes until the vegetables are crisp-tender. Finally, whisk the sauce and pour it into the skillet, cooking for an additional minute until the sauce thickens.",
"Butter Corn Cup":"To prepare Butter Corn Cup, start by measuring 2 cups of frozen corn and thawing it by placing it in a sieve and running it under cold water. Next, transfer the thawed corn into a microwave-safe bowl, add 1 teaspoon of softened butter and 1 teaspoon of pepper powder, and stir well. Microwave the mixture for 5 minutes in total, with the first 2 minutes followed by an additional 3 minutes. Finally, add 1 teaspoon of salt and lime juice extracted from 1/3 of a lime, then mix thoroughly.",
"Caprese Bruschetta":"To prepare Caprese Bruschetta, first, mix 1/8 cup shredded mozzarella with 1/4 tsp salt and 1/4 tsp pepper in a bowl. Slice the baguette into 1/2-inch rounds, brush 2 slices with olive oil, and toast until lightly charred. Meanwhile, halve 1/4 cup of cherry tomatoes and add them to a bowl with 1/16 cup fresh basil. Combine the tomato-basil mixture with the mozzarella mixture, then spoon the mixture onto the toasted bread slices.",
"Cheese Pimiento":"The procedure for making Cheese Pimiento involves first chopping 1/4 red bell pepper and microwaving it for 2 minutes with 1 tablespoons of water, then melting 1/3 cup cheddar cheese by microwaving cup for 30 sec (Check after 30 seconds and microwave for 10 seconds more if needed) separately before combining it with 1/4 teaspoon salt and the peppers. After mixing in seasonings and 1/2 tbsp softened butter, the mixture is thoroughly combined and ready to be served or used as desired. Microwave the bowl, covered, for 2 minutes.",
"Coffee":"To make coffee using a drip method, start by measuring 12 ounces of cold water and placing a dripper with a folded paper filter on a mug. Weigh and grind (about 20 seconds) the coffee beans (0.8oz-0.12 oz) to a coarse consistency, then heat the water to between 195-205°F (91-96°C). Wet the coffee grounds with a small amount of hot water to allow them to bloom for about 30 seconds, then slowly pour the remaining hot water over the grounds in a circular motion. Finally, discard the used filter and grounds, and wait for the coffee to drain completely before removing the dripper.",
"Cucumber Raita":"To make cucumber raita, start by whisking 1 cup of chilled curd until smooth in a mixing bowl, then add spices including red chilli powder, 1/2 teaspoon of chaat masala, and 1 teaspoon of cumin powder. Next, rinse and peel a medium-sized cucumber, chop or grate it, and add it to the bowl with the curd. Finally, mix in 1 tablespoon of chopped cilantro and 1/4 teaspoon salt, and combine all the ingredients thoroughly.",
"Dressed Up Meatballs":"To prepare Dressed Up Meatballs, start by placing five meatballs on a microwave-safe plate. Next, prepare the toppings by peeling one and mincing 1/8 garlic clove, slicing and cutting a 1/8 medium onion into two pieces, and cutting 1/4 medium carrot into thin strips. Arrange these ingredients on top of the meatballs along with 1/4 tsp pepper. In a separate bowl, mix 1/4 cup sweet-and-sour sauce with 1/2 teaspoon soy sauce. Pour this mixture over the meatballs and their accompaniments. Cover the plate and microwave on high for 1.5 minutes, then stir and continue microwaving for an additional 1 minute.",
"Herb Omelet with Fried Tomatoes":"To prepare a Herb Omelet with Fried Tomatoes, first chop 2 tablespoons of cilantro and cut a tomato into two pieces, then crack one egg into a bowl, add the chopped cilantro and 1/2 teaspoon of ground black pepper, and beat the mixture well. In a non-stick frying pan, heat 1 tablespoon of oil, cook the tomato slices cut-side down until softened, remove them, and place them on a serving plate. Pour the beaten egg mixture into the pan, stir gently to distribute the egg, and let it set into an omelette. Finally, transfer the omelette to the plate with the tomatoes and serve.",
"Microwave Egg Sandwich":"To prepare a microwave egg sandwich, first coat a 6-oz. ramekin with cooking spray, crack an egg into it, and microwave for 30 seconds. Next, cut an English muffin in half with knife, stir the partially cooked egg, and continue microwaving for an additional 15-30 seconds until the egg is almost set. Add 1 tablespoon of salsa and 1 tablespoon of cheese to the egg, microwave briefly until the cheese melts about 10 seconds, then assemble the sandwich by placing the egg on lettuce in the bottom half of the muffin and topping with the other half.",
"Microwave French Toast":"To prepare Microwave French Toast, first cut or tear bread into bite-size pieces. In a large mug, melt butter, mix it with one whisked egg, 1/4 teaspoon cinnamon, and 1/4 teaspoon vanilla, then add the bread pieces, pressing them down. Microwave on high for 90 seconds until fully cooked, then transfer to a plate, cut, and serve.",
"Microwave Mug Pizza":"To prepare a microwave mug pizza, first gather all ingredients and measure out the dry ingredients (1/16 teaspoon baking soda, 1/8 teaspoon salt, 1/8 teaspoon baking powder, and 4 tablespoons flour) into a microwavable mug, followed by adding wet ingredients (3 tablespoons milk, 1 tablespoon olive oil, and 1 tablespoon marinara sauce), and topping it with 1 generous tablespoon of mozzarella cheese and herbs. Mix well, then microwave for 1 minute and 20 seconds until the pizza has risen and the toppings are bubbling.",
"Mug Cake":"To make a mug cake, first prepare the dry ingredients by whisking together 2 tablespoons of flour, 1.5 tablespoons of sugar, 1/4 teaspoon of baking powder and a pinch of salt in a bowl, then add 2 tablespoons of water, 1/4 teaspoon of vanilla extract, and 2 teaspoons of vegetable oil, whisking until smooth. Next, place a paper cupcake liner in a mug, pour the batter into the mug, and microwave for 60 seconds. Once done, invert the mug onto a plate, allow it to cool, scoop 4 spoonfuls of chocolate, and then frost the cake using a piping bag with a small opening 1/4 inch in diameter.",
"Pan Fried Tofu":"To prepare pan-fried tofu, start by cutting 1/4 block or 3 ounces of fresh tofu into 1-inch cubes and patting it dry. Heat a non-stick pan with 1 tablespoon of olive oil over medium heat, add the tofu cubes, and season with 1/4 tsp salt, cook pan for 2 minutes. Cook for 5-6 minutes until lightly browned on one side, then flip and cook until browned on the other side. Drizzle 1 tablespoon soy sauce and 1 tablespoons sesame oil over the tofu, return to low heat, and cook for an additional 4 minutes, flipping halfway through, until the tofu is well-cooked and golden. Serve immediately.",
"Pinwheels":"To make pinwheels, start by placing an 8-inch flour tortilla on a cutting board and spread nut butter over it, leaving a 1/2-inch border. Next, add jelly over the nut butter, then roll the tortilla tightly into a log shape about 1.5 inches thick, securing it by inserting 5 toothpicks about 1 inch apart and trimming the ends. Finally, use dental floss to cut the roll into 1 more pinwheel (pull the floss ends in opposite directions to slice) and place them on a plate.",
"Ramen":"To prepare Ramen, start by peeling and chopping one garlic clove, slicing a quarter of a medium onion, and adding these vegetables to a microwave-safe bowl along with unbroken or broken noodles, depending on preference. Cover the bowl with water, a lid, or paper towels to prevent splattering, then microwave for 4 minutes. After microwaving, let the noodles sit for a minute, then add basil, chopped cilantro, and the flavor packet, stirring well until the noodles are fully flavored.",
"Sauted Mushrooms":"First, prepare the ingredients by rinsing 3 mushrooms under cold water, dry with a paper towel and chopping it, peeling and mincing 2 cloves of the garlic, and chopping 1 shallot. Then, heat 1 tbsp olive oil in a skillet, add the mushrooms and cook for 3-5 minutes, stirring often, until they soften and brown, followed by adding the shallot and garlic, cooking for 1 minute, often stirring, before seasoning with 1/4 tbsp balsamic vinegar, pepper, and salt. Finally, transfer the sautéed mushrooms to a serving dish.",
"Scrambled Eggs":"To prepare scrambled eggs with a flavorful twist, start by chopping 1/4 medium onion and sautéing it on medium heat, 2 garlic cloves, 1 green chili, cook for 1 minute, mixing everything, and add 1/8 tsp of turmeric and 1/4 tomatoes until the onions are soft and translucent. In a separate bowl, whisk together eggs, 1 tbsp milk, and 1/3 tsp salt. Heat 2 tbsp oil in a pan, add spices, and pour in the whisked eggs, cooking them gently for about 3 minutes until almost set. Chop and garnish with 1 tsp cilantro before serving.",
"Spiced Hot Chocolate":"To prepare spiced hot chocolate, start by filling a microwave-safe mug with skimmed milk, then microwave it for 1 minute. Next, add 1/5 teaspoon of cinnamon, 2 pieces of chocolate, and 1 teaspoon of white sugar to the mug, mix well, and heat the mixture for another minute before serving.",
"Spicy Tuna Avocado Wraps":"To prepare Spicy Tuna Avocado Wraps, start by preparing the ingredients: halve and thinly slice one ripe avocado, open a can of tuna, and chop one scallion. In a bowl, mix the avocado slices with 1/4 cup mayonnaise, 1 teaspoon Sriracha sauce, and the chopped scallion, then add the drained tuna and mix well. Season the mixture with 1/4 tsp salt and 1/4 tsp pepper. Lay out two large lettuce leaves, place the tuna mixture on each, roll them up tightly, and secure with a toothpick.",
"Tomato Chutney":"To make tomato chutney, start by preparing the ingredients: peel and mince 4 large garlic cloves, chop 1 tomato roughly, and puree it in a blender. In a pan, heat 3 tablespoons of oil, add 1/2 tsp cumin and 1/4 tsp mustard seeds, then sauté the minced garlic for 2-3 minutes until fragrant. Add 2 tbsp red chili powder, tomato puree, and 1/2 tsp salt, mixing well. Simmer the mixture over low heat for 5 minutes until thickened, then transfer it to a serving bowl and let it cool.",
"Tomato Mozzarella Salad":"To prepare a Tomato Mozzarella Salad, start by rinsing a tomato, gently drying it with a paper/tea towel, and slicing it into approximately 1/2-inch thick pieces. Arrange these slices in a single layer on a platter, sprinkle mozzarella cheese evenly over them, and season with salt, 1/4 teaspoon black pepper, and Italian seasoning. Finish by drizzling the salad with a tablespoon of extra-virgin olive oil and garnish as desired.",
"Zoodles":"To make zoodles, first spiralize one medium zucchini into thin noodles and set them aside. In a large heated pan on medium heat, melt 1 tablespoons of softened butter and add 1 large minced garlic, cooking until fragrant (about 1 minutes) but careful not to burn it. Add the zucchini noodles along with 1/6 cup grated Parmesan cheese, season with salt and pepper, and cook for about 2 minutes until the zoodles are tender. Optionally, top with additional Parmesan before serving."

}
